Pismis24/NRF52833_TMK_KB/src/ble/ble_service.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    uint8_t                adv_flags;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_whitelist_enabled          = true;
    init.config.ble_adv_directed_high_duty_enabled = true;
    init.config.ble_adv_directed_enabled           = false;
    init.config.ble_adv_directed_interval          = 0;
    init.config.ble_adv_directed_timeout           = 0;
    init.config.ble_adv_fast_enabled               = true;
    init.config.ble_adv_fast_interval              = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_fast_timeout               = APP_ADV_FAST_DURATION;
    init.config.ble_adv_slow_enabled               = true;
    init.config.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for starting advertising.
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

static void advertising_modes_config_get(ble_advertising_t * const p_advertising,
                                   ble_adv_modes_config_t* p_config)
{
    ble_adv_modes_config_t adv_config = p_advertising->adv_modes_config;
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));
    p_config->ble_adv_whitelist_enabled          = adv_config.ble_adv_whitelist_enabled;
    p_config->ble_adv_directed_high_duty_enabled = adv_config.ble_adv_directed_high_duty_enabled;
    p_config->ble_adv_directed_enabled           = adv_config.ble_adv_directed_enabled;
    p_config->ble_adv_directed_interval          = adv_config.ble_adv_directed_interval;
    p_config->ble_adv_directed_timeout           = adv_config.ble_adv_directed_timeout;
    p_config->ble_adv_fast_enabled               = adv_config.ble_adv_fast_enabled;
    p_config->ble_adv_fast_interval              = adv_config.ble_adv_fast_interval;
    p_config->ble_adv_fast_timeout               = adv_config.ble_adv_fast_timeout;
    p_config->ble_adv_slow_enabled               = adv_config.ble_adv_slow_enabled;
    p_config->ble_adv_slow_interval              = adv_config.ble_adv_slow_interval;
    p_config->ble_adv_slow_timeout               = adv_config.ble_adv_slow_timeout;
    p_config->ble_adv_on_disconnect_disabled     = adv_config.ble_adv_on_disconnect_disabled;
}

static bool manual_disconnect = false;

void ble_conn_close(void)
{
    if(manual_disconnect){
        return;
    }
    // Prevent device from advertising on disconnect.
    ble_adv_modes_config_t config;
    advertising_modes_config_get(&m_advertising, &config);
    config.ble_adv_on_disconnect_disabled = true;
    ble_advertising_modes_config_set(&m_advertising, &config);
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        sd_ble_gap_adv_stop(m_advertising.adv_handle);
    } else {
        sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }
    manual_disconnect = true;
    trig_kb_event_param(KB_EVT_BLE, KB_BLE_ADV_STOP);
}

void ble_conn_restart(void)
{
    if(!manual_disconnect){
        return;
    }
    // setting adv config to default
    ble_adv_modes_config_t config;
    advertising_modes_config_get(&m_advertising, &config);
    config.ble_adv_on_disconnect_disabled = false;
    ble_advertising_modes_config_set(&m_advertising, &config);

    advertising_start(false);
    manual_disconnect = false;
}

void ble_conn_toggle(void)
{
    if(!manual_disconnect){
        ble_conn_close();
    }
    else{
        ble_conn_restart();
    }
}

/*蓝牙服务初始化函数*/
void ble_init()
{
    ble_stack_init();
    gap_params_init();
    gatt_init();  
    conn_params_init();
    peer_manager_init();
    advertising_init();
    qwr_services_init();
    // services init
    dis_init();
    bas_init();
    hid_init();

}